---
kind: method
id: M:Autodesk.Revit.DB.RepeaterCoordinates.Dispose
source: html/1e132504-a3f1-0a5d-9c83-7ea9aa09a4d1.htm
---
# Autodesk.Revit.DB.RepeaterCoordinates.Dispose Method

Releases all resources used by the RepeaterCoordinates

## Syntax (C#)
```csharp
public void Dispose()
```